readInputFile> Parsing file runs/input_4_200_8_1

readInputFile> Detected keyword ModeAndScheme
               mode=1 => mapNF at diff. lambda and diff. Inc. and Sca_angles
               scheme=1 => Seek T^(ji) by direct inversion of A in Ax=b
readInputFile> Detected keyword MultipoleCutoff
               Supplied ncut(1)=  8
               Setting ncut(2)= ncut(1)
               Setting ncut(3)=  -8
readInputFile> Detected keyword ScattererCentredCrossSections
readInputFile> Detected keyword Incidence
readInputFile> Euler angle alpha [0,2Pi) grid-points:  200
readInputFile> Euler angle beta  [0,Pi]  value=   0.00000000
readInputFile> Euler angle gamma [0,2Pi) value=   0.00000000
readInputFile> X-linear polarization
               Incident Euler angles and weights:
                  alpha        beta        gamma        weight
               0.01570796   0.00000000   0.00000000   0.00500000
               0.04712389   0.00000000   0.00000000   0.00500000
               0.07853982   0.00000000   0.00000000   0.00500000
               0.10995574   0.00000000   0.00000000   0.00500000
               0.14137167   0.00000000   0.00000000   0.00500000
               0.17278760   0.00000000   0.00000000   0.00500000
               0.20420352   0.00000000   0.00000000   0.00500000
               0.23561945   0.00000000   0.00000000   0.00500000
               0.26703538   0.00000000   0.00000000   0.00500000
               0.29845130   0.00000000   0.00000000   0.00500000
               0.32986723   0.00000000   0.00000000   0.00500000
               0.36128316   0.00000000   0.00000000   0.00500000
               0.39269908   0.00000000   0.00000000   0.00500000
               0.42411501   0.00000000   0.00000000   0.00500000
               0.45553093   0.00000000   0.00000000   0.00500000
               0.48694686   0.00000000   0.00000000   0.00500000
               0.51836279   0.00000000   0.00000000   0.00500000
               0.54977871   0.00000000   0.00000000   0.00500000
               0.58119464   0.00000000   0.00000000   0.00500000
               0.61261057   0.00000000   0.00000000   0.00500000
               0.64402649   0.00000000   0.00000000   0.00500000
               0.67544242   0.00000000   0.00000000   0.00500000
               0.70685835   0.00000000   0.00000000   0.00500000
               0.73827427   0.00000000   0.00000000   0.00500000
               0.76969020   0.00000000   0.00000000   0.00500000
               0.80110613   0.00000000   0.00000000   0.00500000
               0.83252205   0.00000000   0.00000000   0.00500000
               0.86393798   0.00000000   0.00000000   0.00500000
               0.89535391   0.00000000   0.00000000   0.00500000
               0.92676983   0.00000000   0.00000000   0.00500000
               0.95818576   0.00000000   0.00000000   0.00500000
               0.98960169   0.00000000   0.00000000   0.00500000
               1.02101761   0.00000000   0.00000000   0.00500000
               1.05243354   0.00000000   0.00000000   0.00500000
               1.08384947   0.00000000   0.00000000   0.00500000
               1.11526539   0.00000000   0.00000000   0.00500000
               1.14668132   0.00000000   0.00000000   0.00500000
               1.17809725   0.00000000   0.00000000   0.00500000
               1.20951317   0.00000000   0.00000000   0.00500000
               1.24092910   0.00000000   0.00000000   0.00500000
               1.27234502   0.00000000   0.00000000   0.00500000
               1.30376095   0.00000000   0.00000000   0.00500000
               1.33517688   0.00000000   0.00000000   0.00500000
               1.36659280   0.00000000   0.00000000   0.00500000
               1.39800873   0.00000000   0.00000000   0.00500000
               1.42942466   0.00000000   0.00000000   0.00500000
               1.46084058   0.00000000   0.00000000   0.00500000
               1.49225651   0.00000000   0.00000000   0.00500000
               1.52367244   0.00000000   0.00000000   0.00500000
               1.55508836   0.00000000   0.00000000   0.00500000
               1.58650429   0.00000000   0.00000000   0.00500000
               1.61792022   0.00000000   0.00000000   0.00500000
               1.64933614   0.00000000   0.00000000   0.00500000
               1.68075207   0.00000000   0.00000000   0.00500000
               1.71216800   0.00000000   0.00000000   0.00500000
               1.74358392   0.00000000   0.00000000   0.00500000
               1.77499985   0.00000000   0.00000000   0.00500000
               1.80641578   0.00000000   0.00000000   0.00500000
               1.83783170   0.00000000   0.00000000   0.00500000
               1.86924763   0.00000000   0.00000000   0.00500000
               1.90066356   0.00000000   0.00000000   0.00500000
               1.93207948   0.00000000   0.00000000   0.00500000
               1.96349541   0.00000000   0.00000000   0.00500000
               1.99491134   0.00000000   0.00000000   0.00500000
               2.02632726   0.00000000   0.00000000   0.00500000
               2.05774319   0.00000000   0.00000000   0.00500000
               2.08915911   0.00000000   0.00000000   0.00500000
               2.12057504   0.00000000   0.00000000   0.00500000
               2.15199097   0.00000000   0.00000000   0.00500000
               2.18340689   0.00000000   0.00000000   0.00500000
               2.21482282   0.00000000   0.00000000   0.00500000
               2.24623875   0.00000000   0.00000000   0.00500000
               2.27765467   0.00000000   0.00000000   0.00500000
               2.30907060   0.00000000   0.00000000   0.00500000
               2.34048653   0.00000000   0.00000000   0.00500000
               2.37190245   0.00000000   0.00000000   0.00500000
               2.40331838   0.00000000   0.00000000   0.00500000
               2.43473431   0.00000000   0.00000000   0.00500000
               2.46615023   0.00000000   0.00000000   0.00500000
               2.49756616   0.00000000   0.00000000   0.00500000
               2.52898209   0.00000000   0.00000000   0.00500000
               2.56039801   0.00000000   0.00000000   0.00500000
               2.59181394   0.00000000   0.00000000   0.00500000
               2.62322987   0.00000000   0.00000000   0.00500000
               2.65464579   0.00000000   0.00000000   0.00500000
               2.68606172   0.00000000   0.00000000   0.00500000
               2.71747765   0.00000000   0.00000000   0.00500000
               2.74889357   0.00000000   0.00000000   0.00500000
               2.78030950   0.00000000   0.00000000   0.00500000
               2.81172542   0.00000000   0.00000000   0.00500000
               2.84314135   0.00000000   0.00000000   0.00500000
               2.87455728   0.00000000   0.00000000   0.00500000
               2.90597320   0.00000000   0.00000000   0.00500000
               2.93738913   0.00000000   0.00000000   0.00500000
               2.96880506   0.00000000   0.00000000   0.00500000
               3.00022098   0.00000000   0.00000000   0.00500000
               3.03163691   0.00000000   0.00000000   0.00500000
               3.06305284   0.00000000   0.00000000   0.00500000
               3.09446876   0.00000000   0.00000000   0.00500000
               3.12588469   0.00000000   0.00000000   0.00500000
               3.15730062   0.00000000   0.00000000   0.00500000
               3.18871654   0.00000000   0.00000000   0.00500000
               3.22013247   0.00000000   0.00000000   0.00500000
               3.25154840   0.00000000   0.00000000   0.00500000
               3.28296432   0.00000000   0.00000000   0.00500000
               3.31438025   0.00000000   0.00000000   0.00500000
               3.34579618   0.00000000   0.00000000   0.00500000
               3.37721210   0.00000000   0.00000000   0.00500000
               3.40862803   0.00000000   0.00000000   0.00500000
               3.44004396   0.00000000   0.00000000   0.00500000
               3.47145988   0.00000000   0.00000000   0.00500000
               3.50287581   0.00000000   0.00000000   0.00500000
               3.53429174   0.00000000   0.00000000   0.00500000
               3.56570766   0.00000000   0.00000000   0.00500000
               3.59712359   0.00000000   0.00000000   0.00500000
               3.62853951   0.00000000   0.00000000   0.00500000
               3.65995544   0.00000000   0.00000000   0.00500000
               3.69137137   0.00000000   0.00000000   0.00500000
               3.72278729   0.00000000   0.00000000   0.00500000
               3.75420322   0.00000000   0.00000000   0.00500000
               3.78561915   0.00000000   0.00000000   0.00500000
               3.81703507   0.00000000   0.00000000   0.00500000
               3.84845100   0.00000000   0.00000000   0.00500000
               3.87986693   0.00000000   0.00000000   0.00500000
               3.91128285   0.00000000   0.00000000   0.00500000
               3.94269878   0.00000000   0.00000000   0.00500000
               3.97411471   0.00000000   0.00000000   0.00500000
               4.00553063   0.00000000   0.00000000   0.00500000
               4.03694656   0.00000000   0.00000000   0.00500000
               4.06836249   0.00000000   0.00000000   0.00500000
               4.09977841   0.00000000   0.00000000   0.00500000
               4.13119434   0.00000000   0.00000000   0.00500000
               4.16261027   0.00000000   0.00000000   0.00500000
               4.19402619   0.00000000   0.00000000   0.00500000
               4.22544212   0.00000000   0.00000000   0.00500000
               4.25685805   0.00000000   0.00000000   0.00500000
               4.28827397   0.00000000   0.00000000   0.00500000
               4.31968990   0.00000000   0.00000000   0.00500000
               4.35110583   0.00000000   0.00000000   0.00500000
               4.38252175   0.00000000   0.00000000   0.00500000
               4.41393768   0.00000000   0.00000000   0.00500000
               4.44535360   0.00000000   0.00000000   0.00500000
               4.47676953   0.00000000   0.00000000   0.00500000
               4.50818546   0.00000000   0.00000000   0.00500000
               4.53960138   0.00000000   0.00000000   0.00500000
               4.57101731   0.00000000   0.00000000   0.00500000
               4.60243324   0.00000000   0.00000000   0.00500000
               4.63384916   0.00000000   0.00000000   0.00500000
               4.66526509   0.00000000   0.00000000   0.00500000
               4.69668102   0.00000000   0.00000000   0.00500000
               4.72809694   0.00000000   0.00000000   0.00500000
               4.75951287   0.00000000   0.00000000   0.00500000
               4.79092880   0.00000000   0.00000000   0.00500000
               4.82234472   0.00000000   0.00000000   0.00500000
               4.85376065   0.00000000   0.00000000   0.00500000
               4.88517658   0.00000000   0.00000000   0.00500000
               4.91659250   0.00000000   0.00000000   0.00500000
               4.94800843   0.00000000   0.00000000   0.00500000
               4.97942436   0.00000000   0.00000000   0.00500000
               5.01084028   0.00000000   0.00000000   0.00500000
               5.04225621   0.00000000   0.00000000   0.00500000
               5.07367214   0.00000000   0.00000000   0.00500000
               5.10508806   0.00000000   0.00000000   0.00500000
               5.13650399   0.00000000   0.00000000   0.00500000
               5.16791992   0.00000000   0.00000000   0.00500000
               5.19933584   0.00000000   0.00000000   0.00500000
               5.23075177   0.00000000   0.00000000   0.00500000
               5.26216769   0.00000000   0.00000000   0.00500000
               5.29358362   0.00000000   0.00000000   0.00500000
               5.32499955   0.00000000   0.00000000   0.00500000
               5.35641547   0.00000000   0.00000000   0.00500000
               5.38783140   0.00000000   0.00000000   0.00500000
               5.41924733   0.00000000   0.00000000   0.00500000
               5.45066325   0.00000000   0.00000000   0.00500000
               5.48207918   0.00000000   0.00000000   0.00500000
               5.51349511   0.00000000   0.00000000   0.00500000
               5.54491103   0.00000000   0.00000000   0.00500000
               5.57632696   0.00000000   0.00000000   0.00500000
               5.60774289   0.00000000   0.00000000   0.00500000
               5.63915881   0.00000000   0.00000000   0.00500000
               5.67057474   0.00000000   0.00000000   0.00500000
               5.70199067   0.00000000   0.00000000   0.00500000
               5.73340659   0.00000000   0.00000000   0.00500000
               5.76482252   0.00000000   0.00000000   0.00500000
               5.79623845   0.00000000   0.00000000   0.00500000
               5.82765437   0.00000000   0.00000000   0.00500000
               5.85907030   0.00000000   0.00000000   0.00500000
               5.89048623   0.00000000   0.00000000   0.00500000
               5.92190215   0.00000000   0.00000000   0.00500000
               5.95331808   0.00000000   0.00000000   0.00500000
               5.98473401   0.00000000   0.00000000   0.00500000
               6.01614993   0.00000000   0.00000000   0.00500000
               6.04756586   0.00000000   0.00000000   0.00500000
               6.07898178   0.00000000   0.00000000   0.00500000
               6.11039771   0.00000000   0.00000000   0.00500000
               6.14181364   0.00000000   0.00000000   0.00500000
               6.17322956   0.00000000   0.00000000   0.00500000
               6.20464549   0.00000000   0.00000000   0.00500000
               6.23606142   0.00000000   0.00000000   0.00500000
               6.26747734   0.00000000   0.00000000   0.00500000
readInputFile> Detected keyword OutputFormat
               OutputFormat=HDF5
               All output files are stored in file "map_tmp.h5                                                      "
readInputFile> Detected keyword Wavelength
               Wavelength (nm):   633.0000
readInputFile> Detected keyword Medium
               Constant host epsilon=  1.7689E+0
readInputFile> Detected keyword Verbosity
               verbosity=     2 (Medium)
readInputFile> Detected keyword SpacePoints
               i,lb_i,ub_i,npts_i= 1  3.20000000000000000E+01  0.00000000000000000E+00    0
               i,lb_i,ub_i,npts_i= 2  0.00000000000000000E+00  0.00000000000000000E+00    0
               i,lb_i,ub_i,npts_i= 3  0.00000000000000000E+00  0.00000000000000000E+00    0
               nGridPoints=         1
readInputFile> Detected keyword MapQuantity
               Map enhancement |E|**p with p=   2

readInputFile> Detected keyword Scatterers
 with nscat=    4

readInputFile> Descriptor(s) and circumscribing sphere(s):

 scatID String                  x          y          z         R_0
    1   Au                 -5.0000E+1 -5.0000E+1  7.0711E+1  3.0000E+1
    2   Au                  0.0000E+0  0.0000E+0  0.0000E+0  3.0000E+1
    3   Au                  5.0000E+1  5.0000E+1 -7.0711E+1  3.0000E+1
    4   Au                  1.0000E+2  1.0000E+2 -1.4142E+2  3.0000E+1

readInputFile> Individual geometry characteristic(s):

 scatID Details
    1   Mie with ncoats= 0
    2   Mie with ncoats= 0
    3   Mie with ncoats= 0
    4   Mie with ncoats= 0

readInputFile> Dielectric functions for (coated) Mie scatterer(s):

 scatID volID Label
    1     0     Au
    2     0     Au
    3     0     Au
    4     0     Au

readInputFile> Finished parsing 11 keywords


mapNF> ===== Wavelength:   633.00 (nm) ======================

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
solve> Prestaging...
solve> Prestaged Mie T-matrix for scatterer   1 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   1 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   2 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   2 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   3 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   3 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   4 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   4 with q, nlo, nhi = 2  1  8
solve> Staging and solving/inverting...

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  2  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  1  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  3  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  2  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  4  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  3  4

solve> Staged matrix A for the balanced system Ax=b
invSqrMat> ZLANGE: Supplied matrix 1-norm=  2.2453E+000
invSqrMat> ZGECON returned RCOND=  1.8795E-001
solve> Inverted matrix A for the balanced systm Ax=b
solve> Done!

solve> Calculation time [calcSphBessels (reg. & irreg)] (CPU & real in s):   6.980E-04  0.000E+00
solve> Calculation time [calcMieTMat] (CPU & real in s):   4.744E-03  0.000E+00
solve> Calculation time [calcWignerBigD] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [stageAmat] (CPU & real in s):   7.243E-01  6.800E-02
solve> Calculation time [balanceVecJ] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [solLinSys] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [invSqrMat] (CPU & real in s):   2.766E-01  2.800E-02
solve> Calculation time [balanceMatJI] (CPU & real in s):   7.511E-02  6.000E-03
solve> Calculation time [calcTIJStout] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [calcTIMackowski] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [calcMieIntCoeffs] (CPU & real in s):   9.300E-05  0.000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.130E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.011E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   2.146E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.907E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.040E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.030E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.001E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.030E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.011E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.040E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.030E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.57073173E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99876632E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.71064507E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98889875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.84590957E-02  0.00000000E+00
          y:  0.00000000E+00 -9.96917334E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.09734311E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93960955E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.40901232E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90023658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.71929100E-01  0.00000000E+00
          y:  0.00000000E+00 -9.85109326E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.02787295E-01  0.00000000E+00
          y:  0.00000000E+00 -9.79222811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.33445364E-01  0.00000000E+00
          y:  0.00000000E+00 -9.72369920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.63873050E-01  0.00000000E+00
          y:  0.00000000E+00 -9.64557418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.94040325E-01  0.00000000E+00
          y:  0.00000000E+00 -9.55793015E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.23917418E-01  0.00000000E+00
          y:  0.00000000E+00 -9.46085359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.53474844E-01  0.00000000E+00
          y:  0.00000000E+00 -9.35444031E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.871E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.82683432E-01  0.00000000E+00
          y:  0.00000000E+00 -9.23879533E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.990E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.11514359E-01  0.00000000E+00
          y:  0.00000000E+00 -9.11403277E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.39939170E-01  0.00000000E+00
          y:  0.00000000E+00 -8.98027576E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.67929814E-01  0.00000000E+00
          y:  0.00000000E+00 -8.83765630E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.95458668E-01  0.00000000E+00
          y:  0.00000000E+00 -8.68631514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.22498565E-01  0.00000000E+00
          y:  0.00000000E+00 -8.52640164E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.49022818E-01  0.00000000E+00
          y:  0.00000000E+00 -8.35807361E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.75005252E-01  0.00000000E+00
          y:  0.00000000E+00 -8.18149717E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.00420225E-01  0.00000000E+00
          y:  0.00000000E+00 -7.99684658E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.25242656E-01  0.00000000E+00
          y:  0.00000000E+00 -7.80430407E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.49448048E-01  0.00000000E+00
          y:  0.00000000E+00 -7.60405966E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.73012514E-01  0.00000000E+00
          y:  0.00000000E+00 -7.39631095E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.95912797E-01  0.00000000E+00
          y:  0.00000000E+00 -7.18126298E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.18126298E-01  0.00000000E+00
          y:  0.00000000E+00 -6.95912797E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.39631095E-01  0.00000000E+00
          y:  0.00000000E+00 -6.73012514E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.60405966E-01  0.00000000E+00
          y:  0.00000000E+00 -6.49448048E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.80430407E-01  0.00000000E+00
          y:  0.00000000E+00 -6.25242656E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.99684658E-01  0.00000000E+00
          y:  0.00000000E+00 -6.00420225E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.18149717E-01  0.00000000E+00
          y:  0.00000000E+00 -5.75005252E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.35807361E-01  0.00000000E+00
          y:  0.00000000E+00 -5.49022818E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.52640164E-01  0.00000000E+00
          y:  0.00000000E+00 -5.22498565E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.68631514E-01  0.00000000E+00
          y:  0.00000000E+00 -4.95458668E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.030E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.83765630E-01  0.00000000E+00
          y:  0.00000000E+00 -4.67929814E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.98027576E-01  0.00000000E+00
          y:  0.00000000E+00 -4.39939170E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.11403277E-01  0.00000000E+00
          y:  0.00000000E+00 -4.11514359E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.23879533E-01  0.00000000E+00
          y:  0.00000000E+00 -3.82683432E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.35444031E-01  0.00000000E+00
          y:  0.00000000E+00 -3.53474844E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.46085359E-01  0.00000000E+00
          y:  0.00000000E+00 -3.23917418E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.55793015E-01  0.00000000E+00
          y:  0.00000000E+00 -2.94040325E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.64557418E-01  0.00000000E+00
          y:  0.00000000E+00 -2.63873050E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.894E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.72369920E-01  0.00000000E+00
          y:  0.00000000E+00 -2.33445364E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.79222811E-01  0.00000000E+00
          y:  0.00000000E+00 -2.02787295E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.85109326E-01  0.00000000E+00
          y:  0.00000000E+00 -1.71929100E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90023658E-01  0.00000000E+00
          y:  0.00000000E+00 -1.40901232E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.918E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93960955E-01  0.00000000E+00
          y:  0.00000000E+00 -1.09734311E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.96917334E-01  0.00000000E+00
          y:  0.00000000E+00 -7.84590957E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.775E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98889875E-01  0.00000000E+00
          y:  0.00000000E+00 -4.71064507E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.799E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99876632E-01  0.00000000E+00
          y:  0.00000000E+00 -1.57073173E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   9.823E-05  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

mapNF> Calculation time [NFs and LDOC for all inc.] (CPU & real in s):   2.356E-02  2.300E-02

mapNF> Done!

termsProgram> Dumping normalized optical chirality to file normalised_ldoc                                                 
termsProgram> Dumping E  field map to files normalised_ldoc                                                 
termsProgram> Program run time (CPU & real in s):  2.323E+00  3.980E-01
