readInputFile> Parsing file runs/input_8_300_8_0

readInputFile> Detected keyword ModeAndScheme
               mode=1 => mapNF at diff. lambda and diff. Inc. and Sca_angles
               scheme=0 => Do not seek T^(ji) and just solve Ax=b for x
readInputFile> Detected keyword MultipoleCutoff
               Supplied ncut(1)=  8
               Setting ncut(2)= ncut(1)
               Setting ncut(3)=  -8
readInputFile> Detected keyword ScattererCentredCrossSections
readInputFile> Detected keyword Incidence
readInputFile> Euler angle alpha [0,2Pi) grid-points:  300
readInputFile> Euler angle beta  [0,Pi]  value=   0.00000000
readInputFile> Euler angle gamma [0,2Pi) value=   0.00000000
readInputFile> X-linear polarization
               Incident Euler angles and weights:
                  alpha        beta        gamma        weight
               0.01047198   0.00000000   0.00000000   0.00333333
               0.03141593   0.00000000   0.00000000   0.00333333
               0.05235988   0.00000000   0.00000000   0.00333333
               0.07330383   0.00000000   0.00000000   0.00333333
               0.09424778   0.00000000   0.00000000   0.00333333
               0.11519173   0.00000000   0.00000000   0.00333333
               0.13613568   0.00000000   0.00000000   0.00333333
               0.15707963   0.00000000   0.00000000   0.00333333
               0.17802358   0.00000000   0.00000000   0.00333333
               0.19896753   0.00000000   0.00000000   0.00333333
               0.21991149   0.00000000   0.00000000   0.00333333
               0.24085544   0.00000000   0.00000000   0.00333333
               0.26179939   0.00000000   0.00000000   0.00333333
               0.28274334   0.00000000   0.00000000   0.00333333
               0.30368729   0.00000000   0.00000000   0.00333333
               0.32463124   0.00000000   0.00000000   0.00333333
               0.34557519   0.00000000   0.00000000   0.00333333
               0.36651914   0.00000000   0.00000000   0.00333333
               0.38746309   0.00000000   0.00000000   0.00333333
               0.40840704   0.00000000   0.00000000   0.00333333
               0.42935100   0.00000000   0.00000000   0.00333333
               0.45029495   0.00000000   0.00000000   0.00333333
               0.47123890   0.00000000   0.00000000   0.00333333
               0.49218285   0.00000000   0.00000000   0.00333333
               0.51312680   0.00000000   0.00000000   0.00333333
               0.53407075   0.00000000   0.00000000   0.00333333
               0.55501470   0.00000000   0.00000000   0.00333333
               0.57595865   0.00000000   0.00000000   0.00333333
               0.59690260   0.00000000   0.00000000   0.00333333
               0.61784656   0.00000000   0.00000000   0.00333333
               0.63879051   0.00000000   0.00000000   0.00333333
               0.65973446   0.00000000   0.00000000   0.00333333
               0.68067841   0.00000000   0.00000000   0.00333333
               0.70162236   0.00000000   0.00000000   0.00333333
               0.72256631   0.00000000   0.00000000   0.00333333
               0.74351026   0.00000000   0.00000000   0.00333333
               0.76445421   0.00000000   0.00000000   0.00333333
               0.78539816   0.00000000   0.00000000   0.00333333
               0.80634211   0.00000000   0.00000000   0.00333333
               0.82728607   0.00000000   0.00000000   0.00333333
               0.84823002   0.00000000   0.00000000   0.00333333
               0.86917397   0.00000000   0.00000000   0.00333333
               0.89011792   0.00000000   0.00000000   0.00333333
               0.91106187   0.00000000   0.00000000   0.00333333
               0.93200582   0.00000000   0.00000000   0.00333333
               0.95294977   0.00000000   0.00000000   0.00333333
               0.97389372   0.00000000   0.00000000   0.00333333
               0.99483767   0.00000000   0.00000000   0.00333333
               1.01578162   0.00000000   0.00000000   0.00333333
               1.03672558   0.00000000   0.00000000   0.00333333
               1.05766953   0.00000000   0.00000000   0.00333333
               1.07861348   0.00000000   0.00000000   0.00333333
               1.09955743   0.00000000   0.00000000   0.00333333
               1.12050138   0.00000000   0.00000000   0.00333333
               1.14144533   0.00000000   0.00000000   0.00333333
               1.16238928   0.00000000   0.00000000   0.00333333
               1.18333323   0.00000000   0.00000000   0.00333333
               1.20427718   0.00000000   0.00000000   0.00333333
               1.22522113   0.00000000   0.00000000   0.00333333
               1.24616509   0.00000000   0.00000000   0.00333333
               1.26710904   0.00000000   0.00000000   0.00333333
               1.28805299   0.00000000   0.00000000   0.00333333
               1.30899694   0.00000000   0.00000000   0.00333333
               1.32994089   0.00000000   0.00000000   0.00333333
               1.35088484   0.00000000   0.00000000   0.00333333
               1.37182879   0.00000000   0.00000000   0.00333333
               1.39277274   0.00000000   0.00000000   0.00333333
               1.41371669   0.00000000   0.00000000   0.00333333
               1.43466065   0.00000000   0.00000000   0.00333333
               1.45560460   0.00000000   0.00000000   0.00333333
               1.47654855   0.00000000   0.00000000   0.00333333
               1.49749250   0.00000000   0.00000000   0.00333333
               1.51843645   0.00000000   0.00000000   0.00333333
               1.53938040   0.00000000   0.00000000   0.00333333
               1.56032435   0.00000000   0.00000000   0.00333333
               1.58126830   0.00000000   0.00000000   0.00333333
               1.60221225   0.00000000   0.00000000   0.00333333
               1.62315620   0.00000000   0.00000000   0.00333333
               1.64410016   0.00000000   0.00000000   0.00333333
               1.66504411   0.00000000   0.00000000   0.00333333
               1.68598806   0.00000000   0.00000000   0.00333333
               1.70693201   0.00000000   0.00000000   0.00333333
               1.72787596   0.00000000   0.00000000   0.00333333
               1.74881991   0.00000000   0.00000000   0.00333333
               1.76976386   0.00000000   0.00000000   0.00333333
               1.79070781   0.00000000   0.00000000   0.00333333
               1.81165176   0.00000000   0.00000000   0.00333333
               1.83259571   0.00000000   0.00000000   0.00333333
               1.85353967   0.00000000   0.00000000   0.00333333
               1.87448362   0.00000000   0.00000000   0.00333333
               1.89542757   0.00000000   0.00000000   0.00333333
               1.91637152   0.00000000   0.00000000   0.00333333
               1.93731547   0.00000000   0.00000000   0.00333333
               1.95825942   0.00000000   0.00000000   0.00333333
               1.97920337   0.00000000   0.00000000   0.00333333
               2.00014732   0.00000000   0.00000000   0.00333333
               2.02109127   0.00000000   0.00000000   0.00333333
               2.04203522   0.00000000   0.00000000   0.00333333
               2.06297918   0.00000000   0.00000000   0.00333333
               2.08392313   0.00000000   0.00000000   0.00333333
               2.10486708   0.00000000   0.00000000   0.00333333
               2.12581103   0.00000000   0.00000000   0.00333333
               2.14675498   0.00000000   0.00000000   0.00333333
               2.16769893   0.00000000   0.00000000   0.00333333
               2.18864288   0.00000000   0.00000000   0.00333333
               2.20958683   0.00000000   0.00000000   0.00333333
               2.23053078   0.00000000   0.00000000   0.00333333
               2.25147474   0.00000000   0.00000000   0.00333333
               2.27241869   0.00000000   0.00000000   0.00333333
               2.29336264   0.00000000   0.00000000   0.00333333
               2.31430659   0.00000000   0.00000000   0.00333333
               2.33525054   0.00000000   0.00000000   0.00333333
               2.35619449   0.00000000   0.00000000   0.00333333
               2.37713844   0.00000000   0.00000000   0.00333333
               2.39808239   0.00000000   0.00000000   0.00333333
               2.41902634   0.00000000   0.00000000   0.00333333
               2.43997029   0.00000000   0.00000000   0.00333333
               2.46091425   0.00000000   0.00000000   0.00333333
               2.48185820   0.00000000   0.00000000   0.00333333
               2.50280215   0.00000000   0.00000000   0.00333333
               2.52374610   0.00000000   0.00000000   0.00333333
               2.54469005   0.00000000   0.00000000   0.00333333
               2.56563400   0.00000000   0.00000000   0.00333333
               2.58657795   0.00000000   0.00000000   0.00333333
               2.60752190   0.00000000   0.00000000   0.00333333
               2.62846585   0.00000000   0.00000000   0.00333333
               2.64940980   0.00000000   0.00000000   0.00333333
               2.67035376   0.00000000   0.00000000   0.00333333
               2.69129771   0.00000000   0.00000000   0.00333333
               2.71224166   0.00000000   0.00000000   0.00333333
               2.73318561   0.00000000   0.00000000   0.00333333
               2.75412956   0.00000000   0.00000000   0.00333333
               2.77507351   0.00000000   0.00000000   0.00333333
               2.79601746   0.00000000   0.00000000   0.00333333
               2.81696141   0.00000000   0.00000000   0.00333333
               2.83790536   0.00000000   0.00000000   0.00333333
               2.85884931   0.00000000   0.00000000   0.00333333
               2.87979327   0.00000000   0.00000000   0.00333333
               2.90073722   0.00000000   0.00000000   0.00333333
               2.92168117   0.00000000   0.00000000   0.00333333
               2.94262512   0.00000000   0.00000000   0.00333333
               2.96356907   0.00000000   0.00000000   0.00333333
               2.98451302   0.00000000   0.00000000   0.00333333
               3.00545697   0.00000000   0.00000000   0.00333333
               3.02640092   0.00000000   0.00000000   0.00333333
               3.04734487   0.00000000   0.00000000   0.00333333
               3.06828883   0.00000000   0.00000000   0.00333333
               3.08923278   0.00000000   0.00000000   0.00333333
               3.11017673   0.00000000   0.00000000   0.00333333
               3.13112068   0.00000000   0.00000000   0.00333333
               3.15206463   0.00000000   0.00000000   0.00333333
               3.17300858   0.00000000   0.00000000   0.00333333
               3.19395253   0.00000000   0.00000000   0.00333333
               3.21489648   0.00000000   0.00000000   0.00333333
               3.23584043   0.00000000   0.00000000   0.00333333
               3.25678438   0.00000000   0.00000000   0.00333333
               3.27772834   0.00000000   0.00000000   0.00333333
               3.29867229   0.00000000   0.00000000   0.00333333
               3.31961624   0.00000000   0.00000000   0.00333333
               3.34056019   0.00000000   0.00000000   0.00333333
               3.36150414   0.00000000   0.00000000   0.00333333
               3.38244809   0.00000000   0.00000000   0.00333333
               3.40339204   0.00000000   0.00000000   0.00333333
               3.42433599   0.00000000   0.00000000   0.00333333
               3.44527994   0.00000000   0.00000000   0.00333333
               3.46622389   0.00000000   0.00000000   0.00333333
               3.48716785   0.00000000   0.00000000   0.00333333
               3.50811180   0.00000000   0.00000000   0.00333333
               3.52905575   0.00000000   0.00000000   0.00333333
               3.54999970   0.00000000   0.00000000   0.00333333
               3.57094365   0.00000000   0.00000000   0.00333333
               3.59188760   0.00000000   0.00000000   0.00333333
               3.61283155   0.00000000   0.00000000   0.00333333
               3.63377550   0.00000000   0.00000000   0.00333333
               3.65471945   0.00000000   0.00000000   0.00333333
               3.67566340   0.00000000   0.00000000   0.00333333
               3.69660736   0.00000000   0.00000000   0.00333333
               3.71755131   0.00000000   0.00000000   0.00333333
               3.73849526   0.00000000   0.00000000   0.00333333
               3.75943921   0.00000000   0.00000000   0.00333333
               3.78038316   0.00000000   0.00000000   0.00333333
               3.80132711   0.00000000   0.00000000   0.00333333
               3.82227106   0.00000000   0.00000000   0.00333333
               3.84321501   0.00000000   0.00000000   0.00333333
               3.86415896   0.00000000   0.00000000   0.00333333
               3.88510291   0.00000000   0.00000000   0.00333333
               3.90604687   0.00000000   0.00000000   0.00333333
               3.92699082   0.00000000   0.00000000   0.00333333
               3.94793477   0.00000000   0.00000000   0.00333333
               3.96887872   0.00000000   0.00000000   0.00333333
               3.98982267   0.00000000   0.00000000   0.00333333
               4.01076662   0.00000000   0.00000000   0.00333333
               4.03171057   0.00000000   0.00000000   0.00333333
               4.05265452   0.00000000   0.00000000   0.00333333
               4.07359847   0.00000000   0.00000000   0.00333333
               4.09454243   0.00000000   0.00000000   0.00333333
               4.11548638   0.00000000   0.00000000   0.00333333
               4.13643033   0.00000000   0.00000000   0.00333333
               4.15737428   0.00000000   0.00000000   0.00333333
               4.17831823   0.00000000   0.00000000   0.00333333
               4.19926218   0.00000000   0.00000000   0.00333333
               4.22020613   0.00000000   0.00000000   0.00333333
               4.24115008   0.00000000   0.00000000   0.00333333
               4.26209403   0.00000000   0.00000000   0.00333333
               4.28303798   0.00000000   0.00000000   0.00333333
               4.30398194   0.00000000   0.00000000   0.00333333
               4.32492589   0.00000000   0.00000000   0.00333333
               4.34586984   0.00000000   0.00000000   0.00333333
               4.36681379   0.00000000   0.00000000   0.00333333
               4.38775774   0.00000000   0.00000000   0.00333333
               4.40870169   0.00000000   0.00000000   0.00333333
               4.42964564   0.00000000   0.00000000   0.00333333
               4.45058959   0.00000000   0.00000000   0.00333333
               4.47153354   0.00000000   0.00000000   0.00333333
               4.49247749   0.00000000   0.00000000   0.00333333
               4.51342145   0.00000000   0.00000000   0.00333333
               4.53436540   0.00000000   0.00000000   0.00333333
               4.55530935   0.00000000   0.00000000   0.00333333
               4.57625330   0.00000000   0.00000000   0.00333333
               4.59719725   0.00000000   0.00000000   0.00333333
               4.61814120   0.00000000   0.00000000   0.00333333
               4.63908515   0.00000000   0.00000000   0.00333333
               4.66002910   0.00000000   0.00000000   0.00333333
               4.68097305   0.00000000   0.00000000   0.00333333
               4.70191700   0.00000000   0.00000000   0.00333333
               4.72286096   0.00000000   0.00000000   0.00333333
               4.74380491   0.00000000   0.00000000   0.00333333
               4.76474886   0.00000000   0.00000000   0.00333333
               4.78569281   0.00000000   0.00000000   0.00333333
               4.80663676   0.00000000   0.00000000   0.00333333
               4.82758071   0.00000000   0.00000000   0.00333333
               4.84852466   0.00000000   0.00000000   0.00333333
               4.86946861   0.00000000   0.00000000   0.00333333
               4.89041256   0.00000000   0.00000000   0.00333333
               4.91135652   0.00000000   0.00000000   0.00333333
               4.93230047   0.00000000   0.00000000   0.00333333
               4.95324442   0.00000000   0.00000000   0.00333333
               4.97418837   0.00000000   0.00000000   0.00333333
               4.99513232   0.00000000   0.00000000   0.00333333
               5.01607627   0.00000000   0.00000000   0.00333333
               5.03702022   0.00000000   0.00000000   0.00333333
               5.05796417   0.00000000   0.00000000   0.00333333
               5.07890812   0.00000000   0.00000000   0.00333333
               5.09985207   0.00000000   0.00000000   0.00333333
               5.12079603   0.00000000   0.00000000   0.00333333
               5.14173998   0.00000000   0.00000000   0.00333333
               5.16268393   0.00000000   0.00000000   0.00333333
               5.18362788   0.00000000   0.00000000   0.00333333
               5.20457183   0.00000000   0.00000000   0.00333333
               5.22551578   0.00000000   0.00000000   0.00333333
               5.24645973   0.00000000   0.00000000   0.00333333
               5.26740368   0.00000000   0.00000000   0.00333333
               5.28834763   0.00000000   0.00000000   0.00333333
               5.30929158   0.00000000   0.00000000   0.00333333
               5.33023554   0.00000000   0.00000000   0.00333333
               5.35117949   0.00000000   0.00000000   0.00333333
               5.37212344   0.00000000   0.00000000   0.00333333
               5.39306739   0.00000000   0.00000000   0.00333333
               5.41401134   0.00000000   0.00000000   0.00333333
               5.43495529   0.00000000   0.00000000   0.00333333
               5.45589924   0.00000000   0.00000000   0.00333333
               5.47684319   0.00000000   0.00000000   0.00333333
               5.49778714   0.00000000   0.00000000   0.00333333
               5.51873109   0.00000000   0.00000000   0.00333333
               5.53967505   0.00000000   0.00000000   0.00333333
               5.56061900   0.00000000   0.00000000   0.00333333
               5.58156295   0.00000000   0.00000000   0.00333333
               5.60250690   0.00000000   0.00000000   0.00333333
               5.62345085   0.00000000   0.00000000   0.00333333
               5.64439480   0.00000000   0.00000000   0.00333333
               5.66533875   0.00000000   0.00000000   0.00333333
               5.68628270   0.00000000   0.00000000   0.00333333
               5.70722665   0.00000000   0.00000000   0.00333333
               5.72817061   0.00000000   0.00000000   0.00333333
               5.74911456   0.00000000   0.00000000   0.00333333
               5.77005851   0.00000000   0.00000000   0.00333333
               5.79100246   0.00000000   0.00000000   0.00333333
               5.81194641   0.00000000   0.00000000   0.00333333
               5.83289036   0.00000000   0.00000000   0.00333333
               5.85383431   0.00000000   0.00000000   0.00333333
               5.87477826   0.00000000   0.00000000   0.00333333
               5.89572221   0.00000000   0.00000000   0.00333333
               5.91666616   0.00000000   0.00000000   0.00333333
               5.93761012   0.00000000   0.00000000   0.00333333
               5.95855407   0.00000000   0.00000000   0.00333333
               5.97949802   0.00000000   0.00000000   0.00333333
               6.00044197   0.00000000   0.00000000   0.00333333
               6.02138592   0.00000000   0.00000000   0.00333333
               6.04232987   0.00000000   0.00000000   0.00333333
               6.06327382   0.00000000   0.00000000   0.00333333
               6.08421777   0.00000000   0.00000000   0.00333333
               6.10516172   0.00000000   0.00000000   0.00333333
               6.12610567   0.00000000   0.00000000   0.00333333
               6.14704963   0.00000000   0.00000000   0.00333333
               6.16799358   0.00000000   0.00000000   0.00333333
               6.18893753   0.00000000   0.00000000   0.00333333
               6.20988148   0.00000000   0.00000000   0.00333333
               6.23082543   0.00000000   0.00000000   0.00333333
               6.25176938   0.00000000   0.00000000   0.00333333
               6.27271333   0.00000000   0.00000000   0.00333333
readInputFile> Detected keyword OutputFormat
               OutputFormat=HDF5
               All output files are stored in file "map_tmp.h5                                                      "
readInputFile> Detected keyword Wavelength
               Wavelength (nm):   633.0000
readInputFile> Detected keyword Medium
               Constant host epsilon=  1.7689E+0
readInputFile> Detected keyword Verbosity
               verbosity=     2 (Medium)
readInputFile> Detected keyword SpacePoints
               i,lb_i,ub_i,npts_i= 1  3.20000000000000000E+01  0.00000000000000000E+00    0
               i,lb_i,ub_i,npts_i= 2  0.00000000000000000E+00  0.00000000000000000E+00    0
               i,lb_i,ub_i,npts_i= 3  0.00000000000000000E+00  0.00000000000000000E+00    0
               nGridPoints=         1
readInputFile> Detected keyword MapQuantity
               Map enhancement |E|**p with p=   2

readInputFile> Detected keyword Scatterers
 with nscat=    8

readInputFile> Descriptor(s) and circumscribing sphere(s):

 scatID String                  x          y          z         R_0
    1   Au                 -1.5000E+2 -1.5000E+2  2.1213E+2  3.0000E+1
    2   Au                 -1.0000E+2 -1.0000E+2  1.4142E+2  3.0000E+1
    3   Au                 -5.0000E+1 -5.0000E+1  7.0711E+1  3.0000E+1
    4   Au                  0.0000E+0  0.0000E+0  0.0000E+0  3.0000E+1
    5   Au                  5.0000E+1  5.0000E+1 -7.0711E+1  3.0000E+1
    6   Au                  1.0000E+2  1.0000E+2 -1.4142E+2  3.0000E+1
    7   Au                  1.5000E+2  1.5000E+2 -2.1213E+2  3.0000E+1
    8   Au                  2.0000E+2  2.0000E+2 -2.8284E+2  3.0000E+1

readInputFile> Individual geometry characteristic(s):

 scatID Details
    1   Mie with ncoats= 0
    2   Mie with ncoats= 0
    3   Mie with ncoats= 0
    4   Mie with ncoats= 0
    5   Mie with ncoats= 0
    6   Mie with ncoats= 0
    7   Mie with ncoats= 0
    8   Mie with ncoats= 0

readInputFile> Dielectric functions for (coated) Mie scatterer(s):

 scatID volID Label
    1     0     Au
    2     0     Au
    3     0     Au
    4     0     Au
    5     0     Au
    6     0     Au
    7     0     Au
    8     0     Au

readInputFile> Finished parsing 11 keywords

 mapNF> WARNING: orientation averaged quantities are not calculated at scheme = 0

mapNF> ===== Wavelength:   633.00 (nm) ======================

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
solve> Prestaging...
solve> Prestaged Mie T-matrix for scatterer   1 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   1 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   2 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   2 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   3 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   3 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   4 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   4 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   5 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   5 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   6 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   6 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   7 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   7 with q, nlo, nhi = 2  1  8
solve> Prestaged Mie T-matrix for scatterer   8 with q, nlo, nhi = 1  1  8
solve> Prestaged Mie T-matrix for scatterer   8 with q, nlo, nhi = 2  1  8
solve> Staging and solving/inverting...

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  2  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  5  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  6  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.9E-002 Tr(|Tmat|)= 3.2E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  7  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.6E-002 Tr(|Tmat|)= 2.7E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  1

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  1  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  3  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  5  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  6  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  7  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.9E-002 Tr(|Tmat|)= 3.2E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  2

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  2  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  4  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  5  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  6  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  7  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  3

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  3  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  5  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  6  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  7  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  4

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  4  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  6  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  7  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  5

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  5  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  7  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  8  6

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.9E-002 Tr(|Tmat|)= 3.2E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  5  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  6  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  8  7

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.6E-002 Tr(|Tmat|)= 2.7E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  1  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.9E-002 Tr(|Tmat|)= 3.2E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  2  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 7.5E-002 Tr(|Tmat|)= 3.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  3  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.0E-001 Tr(|Tmat|)= 4.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  4  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 4.8E+000 Tr(|Tmat|)= 6.4E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  5  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 2.1E+002 Tr(|Tmat|)= 9.8E-002 nconv=  4
stageAmat> Offset and balanced block (j,k)=  6  8

offsetTmat> Initial Max(|Tmat|)= 8.2E-002 Tr(|Tmat|)= 2.5E-001 nconv=  4
offsetTmat>   Final Max(|Tmat|)= 1.9E+005 Tr(|Tmat|)= 2.4E-001 nconv=  5
stageAmat> Offset and balanced block (j,k)=  7  8

solve> Staged balanced system(s) Ax=b
solLinSys> ZLANGE: Supplied matrix 1-norm=  2.6241E+000
solLinSys> ZGECON returned RCOND=  1.3311E-001
solLinSys> isol=  0 triggered wrapper for LAPACK's ZGESV
solve> Solved balanced Ax=b for x without inverting A
solve> Done!

solve> Calculation time [calcSphBessels (reg. & irreg)] (CPU & real in s):   1.062E-03  0.000E+00
solve> Calculation time [calcMieTMat] (CPU & real in s):   1.043E-02  1.000E-03
solve> Calculation time [calcWignerBigD] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [stageAmat] (CPU & real in s):   5.502E-01  1.810E-01
solve> Calculation time [balanceVecJ] (CPU & real in s):   1.640E-01  1.700E-02
solve> Calculation time [solLinSys] (CPU & real in s):   8.308E-01  9.400E-02
solve> Calculation time [invSqrMat] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [balanceMatJI] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [calcTIJStout] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [calcTIMackowski] (CPU & real in s):   0.000E+00  0.000E+00
solve> Calculation time [calcMieIntCoeffs] (CPU & real in s):   4.252E-03  1.000E-03
parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   6.308E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   2.289E-05  1.000E-03
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.959E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.932E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.907E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   6.000E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.907E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.905E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.897E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.908E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.922E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.912E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.902E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.980E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.914E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.920E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.902E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.912E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.906E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.923E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.983E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.940E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.897E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.928E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.909E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.905E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.900E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.971E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.669E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.919E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.919E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.896E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.930E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.478E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.896E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.918E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.893E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.972E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.903E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.907E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.502E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.800E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.920E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.906E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.957E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.966E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.924E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   2.003E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.904E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.917E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.903E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.906E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.574E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.902E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.914E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   6.029E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.923E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.911E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.903E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.892E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.911E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.879E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.978E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.904E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.908E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.502E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.903E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.923E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.920E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.916E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.902E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.969E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.899E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.908E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.897E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.917E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.883E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.926E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.985E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.788E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.930E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.905E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.916E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.597E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.900E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.905E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.906E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.478E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.965E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.911E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.926E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   2.003E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.898E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.939E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.911E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.907E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.912E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.884E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.898E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.974E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.914E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.812E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.899E-03  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.693E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.884E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.621E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   5.920E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.717E-05  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.310E-03  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.141E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   2.146E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.201E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.120E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.139E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.160E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.969E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.010E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.122E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.170E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  1.000E-03
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.988E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   3.815E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.160E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.139E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.04717841E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99945169E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.14107591E-02  0.00000000E+00
          y:  0.00000000E+00 -9.99506560E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.23359562E-02  0.00000000E+00
          y:  0.00000000E+00 -9.98629535E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.991E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.32381971E-02  0.00000000E+00
          y:  0.00000000E+00 -9.97314477E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.41083133E-02  0.00000000E+00
          y:  0.00000000E+00 -9.95561965E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.14937150E-01  0.00000000E+00
          y:  0.00000000E+00 -9.93372766E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.35715572E-01  0.00000000E+00
          y:  0.00000000E+00 -9.90747840E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.56434465E-01  0.00000000E+00
          y:  0.00000000E+00 -9.87688341E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.77084740E-01  0.00000000E+00
          y:  0.00000000E+00 -9.84195608E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  1.97657340E-01  0.00000000E+00
          y:  0.00000000E+00 -9.80271175E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.18143241E-01  0.00000000E+00
          y:  0.00000000E+00 -9.75916762E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.38533458E-01  0.00000000E+00
          y:  0.00000000E+00 -9.71134280E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.58819045E-01  0.00000000E+00
          y:  0.00000000E+00 -9.65925826E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.78991106E-01  0.00000000E+00
          y:  0.00000000E+00 -9.60293686E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  2.99040792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.54240329E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.18959309E-01  0.00000000E+00
          y:  0.00000000E+00 -9.47768410E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.38737920E-01  0.00000000E+00
          y:  0.00000000E+00 -9.40880769E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.58367950E-01  0.00000000E+00
          y:  0.00000000E+00 -9.33580426E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.77840787E-01  0.00000000E+00
          y:  0.00000000E+00 -9.25870585E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  3.97147891E-01  0.00000000E+00
          y:  0.00000000E+00 -9.17754626E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.16280792E-01  0.00000000E+00
          y:  0.00000000E+00 -9.09236109E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.979E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.35231099E-01  0.00000000E+00
          y:  0.00000000E+00 -9.00318771E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.53990500E-01  0.00000000E+00
          y:  0.00000000E+00 -8.91006524E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.72550765E-01  0.00000000E+00
          y:  0.00000000E+00 -8.81303452E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  4.90903754E-01  0.00000000E+00
          y:  0.00000000E+00 -8.71213811E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.09041416E-01  0.00000000E+00
          y:  0.00000000E+00 -8.60742027E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.26955795E-01  0.00000000E+00
          y:  0.00000000E+00 -8.49892693E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.44639035E-01  0.00000000E+00
          y:  0.00000000E+00 -8.38670568E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.62083378E-01  0.00000000E+00
          y:  0.00000000E+00 -8.27080574E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.79281172E-01  0.00000000E+00
          y:  0.00000000E+00 -8.15127796E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  5.96224875E-01  0.00000000E+00
          y:  0.00000000E+00 -8.02817475E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.12907054E-01  0.00000000E+00
          y:  0.00000000E+00 -7.90155012E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.29320391E-01  0.00000000E+00
          y:  0.00000000E+00 -7.77145961E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.45457688E-01  0.00000000E+00
          y:  0.00000000E+00 -7.63796029E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.61311865E-01  0.00000000E+00
          y:  0.00000000E+00 -7.50111070E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.76875970E-01  0.00000000E+00
          y:  0.00000000E+00 -7.36097087E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  6.92143174E-01  0.00000000E+00
          y:  0.00000000E+00 -7.21760228E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.07106781E-01  0.00000000E+00
          y:  0.00000000E+00 -7.07106781E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.21760228E-01  0.00000000E+00
          y:  0.00000000E+00 -6.92143174E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.36097087E-01  0.00000000E+00
          y:  0.00000000E+00 -6.76875970E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   2.000E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.50111070E-01  0.00000000E+00
          y:  0.00000000E+00 -6.61311865E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.938E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.63796029E-01  0.00000000E+00
          y:  0.00000000E+00 -6.45457688E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.77145961E-01  0.00000000E+00
          y:  0.00000000E+00 -6.29320391E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  7.90155012E-01  0.00000000E+00
          y:  0.00000000E+00 -6.12907054E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.02817475E-01  0.00000000E+00
          y:  0.00000000E+00 -5.96224875E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.15127796E-01  0.00000000E+00
          y:  0.00000000E+00 -5.79281172E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.27080574E-01  0.00000000E+00
          y:  0.00000000E+00 -5.62083378E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.38670568E-01  0.00000000E+00
          y:  0.00000000E+00 -5.44639035E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.49892693E-01  0.00000000E+00
          y:  0.00000000E+00 -5.26955795E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.60742027E-01  0.00000000E+00
          y:  0.00000000E+00 -5.09041416E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.71213811E-01  0.00000000E+00
          y:  0.00000000E+00 -4.90903754E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.81303452E-01  0.00000000E+00
          y:  0.00000000E+00 -4.72550765E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  8.91006524E-01  0.00000000E+00
          y:  0.00000000E+00 -4.53990500E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.00318771E-01  0.00000000E+00
          y:  0.00000000E+00 -4.35231099E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.09236109E-01  0.00000000E+00
          y:  0.00000000E+00 -4.16280792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.17754626E-01  0.00000000E+00
          y:  0.00000000E+00 -3.97147891E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.25870585E-01  0.00000000E+00
          y:  0.00000000E+00 -3.77840787E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.33580426E-01  0.00000000E+00
          y:  0.00000000E+00 -3.58367950E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.40880769E-01  0.00000000E+00
          y:  0.00000000E+00 -3.38737920E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.988E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.47768410E-01  0.00000000E+00
          y:  0.00000000E+00 -3.18959309E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.54240329E-01  0.00000000E+00
          y:  0.00000000E+00 -2.99040792E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.60293686E-01  0.00000000E+00
          y:  0.00000000E+00 -2.78991106E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.65925826E-01  0.00000000E+00
          y:  0.00000000E+00 -2.58819045E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.941E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.71134280E-01  0.00000000E+00
          y:  0.00000000E+00 -2.38533458E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.75916762E-01  0.00000000E+00
          y:  0.00000000E+00 -2.18143241E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.80271175E-01  0.00000000E+00
          y:  0.00000000E+00 -1.97657340E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.84195608E-01  0.00000000E+00
          y:  0.00000000E+00 -1.77084740E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.87688341E-01  0.00000000E+00
          y:  0.00000000E+00 -1.56434465E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.90747840E-01  0.00000000E+00
          y:  0.00000000E+00 -1.35715572E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.93372766E-01  0.00000000E+00
          y:  0.00000000E+00 -1.14937150E-01  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.960E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.95561965E-01  0.00000000E+00
          y:  0.00000000E+00 -9.41083133E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.97314477E-01  0.00000000E+00
          y:  0.00000000E+00 -7.32381971E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.962E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.98629535E-01  0.00000000E+00
          y:  0.00000000E+00 -5.23359562E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.948E-04  1.000E-03

calcLDOC> Calculation time (CPU & real in s):   9.537E-07  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99506560E-01  0.00000000E+00
          y:  0.00000000E+00 -3.14107591E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   1.192E-06  0.000E+00
calcLDOC> Done!

parseInc>         dirn         Re(ampl)         Im(ampl)
          x:  0.00000000E+00  9.99945169E-01  0.00000000E+00
          y:  0.00000000E+00 -1.04717841E-02  0.00000000E+00
          z:  1.00000000E+00  0.00000000E+00  0.00000000E+00
calcField> Calculation time (CPU & real in s):   1.950E-04  0.000E+00

calcLDOC> Calculation time (CPU & real in s):   0.000E+00  0.000E+00
calcLDOC> Done!

mapNF> Calculation time [NFs and LDOC for all inc.] (CPU & real in s):   6.367E-01  9.400E-02

mapNF> Done!

termsProgram> Dumping normalized optical chirality to file normalised_ldoc                                                 
termsProgram> Dumping E  field map to files normalised_ldoc                                                 
termsProgram> Program run time (CPU & real in s):  2.845E+00  4.480E-01
